In [1]:
import pandas as pd

##### Series data structure

In [4]:
s = pd.Series([45,11,25,75,38,72,78,47])

In [5]:
s

0    45
1    11
2    25
3    75
4    38
5    72
6    78
7    47
dtype: int64

In [6]:
s.dtype

dtype('int64')

In [7]:
s.size

8

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s1 = pd.Series([45,11,25,75,38.23,72,78,47])

In [10]:
s1

0    45.00
1    11.00
2    25.00
3    75.00
4    38.23
5    72.00
6    78.00
7    47.00
dtype: float64

In [11]:
s[4]

38

In [12]:
s[4] = 66

In [13]:
s

0    45
1    11
2    25
3    75
4    66
5    72
6    78
7    47
dtype: int64

##### DataFrame

In [15]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['ajay','vijay','rina','priya','amol'])
m = pd.Series([56.78, 78.89, 58.87, 67.77, 62.16])

In [16]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [17]:
df

   roll   name  marks
0     1   ajay  56.78
1     2  vijay  78.89
2     3   rina  58.87
3     4  priya  67.77
4     5   amol  62.16

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.size

15

In [20]:
df.shape

(5, 3)

In [21]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

##### Working with dataset

In [23]:
# https://mitu.co.in/dataset
# Download the student.csv file and store in current working directory

In [24]:
# How to find current working directory?
import os
os.getcwd()

'/home/mitu/dc-nlp-feb25'

In [25]:
df = pd.read_csv('student.csv')

In [26]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df.shape

(10, 5)

In [29]:
df.size

50

In [30]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [34]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [32]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [35]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [36]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### Slicing - Index Based

In [38]:
x = df.iloc[2:7, 1:4]

In [39]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [40]:
df.iloc[2:, 1:4]

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [41]:
df.iloc[2:, 1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [42]:
df.iloc[:7, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [43]:
df.iloc[[4,6,7,2], :]

   roll    name class  marks  age
4     5    asha    TE  63.28   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
2     3  aniket    BE  76.88   19

In [45]:
df.iloc[[4,6,7,2], [1,3]]

     name  marks
4    asha  63.28
6    amar  65.34
7   amita  68.33
2  aniket  76.88

In [46]:
df.iloc[5, :]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [47]:
df.iloc[: , 1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

##### Slicing - Label Based

In [49]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [50]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [51]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [52]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [53]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

##### Functions / Methods on DataFrames

In [57]:
df['marks'].min()

49.55

In [58]:
df['marks'].max()

78.66

In [59]:
df['marks'].mean()

64.499

In [60]:
df['marks'].sum()

644.9899999999999

In [61]:
df['marks'].median()

64.31

In [62]:
df['name'].min()

'ajinkya'

In [63]:
df['name'].max()

'ayesha'

In [64]:
df.sort_values(by='marks')

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21

In [65]:
df.sort_values(by='marks', ascending=False)

   roll     name class  marks  age
9    10    anmol    BE  78.66   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
6     7     amar    BE  65.34   19
4     5     asha    TE  63.28   20
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22
8     9     amol    TE  56.75   20
5     6   ayesha    BE  49.55   20

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [67]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [68]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

##### Custom Column Operations

In [70]:
df['marks'] / 10 + 0.47

0    6.147
1    6.447
2    8.158
3    7.436
4    6.798
5    5.425
6    7.004
7    7.303
8    6.145
9    8.336
Name: marks, dtype: float64

In [71]:
df['marks'] = df['marks'] + 0.47

In [72]:
df

   roll     name class  marks  age
0     1     anil    TE  57.24   22
1     2     amit    TE  60.24   21
2     3   aniket    BE  77.35   19
3     4  ajinkya    TE  70.13   20
4     5     asha    TE  63.75   20
5     6   ayesha    BE  50.02   20
6     7     amar    BE  65.81   19
7     8    amita    BE  68.80   23
8     9     amol    TE  57.22   20
9    10    anmol    BE  79.13   21

In [73]:
df['cgpa'] = df['marks'] / 10 + 0.47

In [74]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.24   22  6.194
1     2     amit    TE  60.24   21  6.494
2     3   aniket    BE  77.35   19  8.205
3     4  ajinkya    TE  70.13   20  7.483
4     5     asha    TE  63.75   20  6.845
5     6   ayesha    BE  50.02   20  5.472
6     7     amar    BE  65.81   19  7.051
7     8    amita    BE  68.80   23  7.350
8     9     amol    TE  57.22   20  6.192
9    10    anmol    BE  79.13   21  8.383

In [75]:
x = ['M','M','M','M','F','F','M','F','M','M']

In [76]:
df['gender'] = x

In [77]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.24   22  6.194      M
1     2     amit    TE  60.24   21  6.494      M
2     3   aniket    BE  77.35   19  8.205      M
3     4  ajinkya    TE  70.13   20  7.483      M
4     5     asha    TE  63.75   20  6.845      F
5     6   ayesha    BE  50.02   20  5.472      F
6     7     amar    BE  65.81   19  7.051      M
7     8    amita    BE  68.80   23  7.350      F
8     9     amol    TE  57.22   20  6.192      M
9    10    anmol    BE  79.13   21  8.383      M

In [78]:
df = pd.read_csv('student.csv')

In [79]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [80]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['ajay','rani','priya','kiran','raju'])
m = pd.Series([67.89, 53.78, 82.45, 76.45, 61.89])
c = pd.Series(['TE','TE','BE','TE','TE'])
a = pd.Series([21,22,22,21,20])

In [81]:
newdf = pd.DataFrame({
    'roll': r,
    'name': n,
    'class': c,
    'marks': m,
    'age': a
})
newdf

   roll   name class  marks  age
0     1   ajay    TE  67.89   21
1     2   rani    TE  53.78   22
2     3  priya    BE  82.45   22
3     4  kiran    TE  76.45   21
4     5   raju    TE  61.89   20

In [82]:
newdf.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [84]:
pd.concat([df, newdf], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1     ajay    TE  67.89   21
11     2     rani    TE  53.78   22
12     3    priya    BE  82.45   22
13     4    kiran    TE  76.45   21
14     5     raju    TE  61.89   20

##### Boolean Filtering

In [87]:
x = df[df['marks'] > 60]

In [88]:
x

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [89]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [90]:
x.to_csv('output.csv', index = False)